SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/SKBI0210PT/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESH!ICESMSLB\/RES.LB!1541768683768!45351246!131073</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2019-01-24T22:05" ArrivalDateTime="2019-01-25T10:10" FlightNumber="6208" NumberInParty="1" ResBookDesigCode="O" Status="NN">      <DestinationLocation   LocationCode="LHR"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="AA" FlightNumber="6208"/>      <OperatingAirline Code="BA"/>      <OriginLocation   LocationCode="YYZ"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-01-25T18:50" ArrivalDateTime="2019-01-26T08:50" FlightNumber="257" NumberInParty="1" ResBookDesigCode="O" Status="NN">      <DestinationLocation   LocationCode="DEL"/>      <Equipment AirEquipType="777"/>      <MarketingAirline Code="BA" FlightNumber="257"/>      <OperatingAirline Code="BA"/>      <OriginLocation   LocationCode="LHR"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-01-31T11:05" ArrivalDateTime="2019-01-31T15:20" FlightNumber="256" NumberInParty="1" ResBookDesigCode="Q" Status="NN">      <DestinationLocation   LocationCode="LHR"/>      <Equipment AirEquipType="777"/>      <MarketingAirline Code="BA" FlightNumber="256"/>      <OperatingAirline Code="BA"/>      <OriginLocation   LocationCode="DEL"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-01-31T17:05" ArrivalDateTime="2019-01-31T20:10" FlightNumber="6213" NumberInParty="1" ResBookDesigCode="Q" Status="NN">      <DestinationLocation   LocationCode="YYZ"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="AA" FlightNumber="6213"/>      <OperatingAirline Code="BA"/>      <OriginLocation   LocationCode="LHR"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>